

export const productList = [
    {
        id : 1,
        title: "پیتزا رست بیف پنجره ای ",
        details: "خمیر پیتزا 21*21 پنجره ای ، رست بیف ، سس آلفردو ، قارچ ، زیتون سیاه و پنیر موزارلا",
        price : 360000,
        imageUrl : "/images/پیتزا رست بیف متوسط.jpg"
    },{
        id : 2,
        title: "پیتزا مخصوص پنجره ای ",
        details: "خمیر پیتزا 21*21 پنجره ای ، ژامبون گوشت و مرغ ، هات داگ ، گوشت چرخکرده ، قارچ ، زیتون سیاه ، فلفل دلمه ای و پنیر موزارلا",
        price : 301000,
        imageUrl : "/images/پیتزا مخصوص متوسط.jpg"
    },{
        id : 3,
        title: "پیتزا پپرونی پنجره ای ",
        details: "خمیر پیتزا 21*21 پنجره ای ، پپرونی ، سس تند ، پنیر موزارلا و فلفل هالوپینو",
        price : 280000,
        imageUrl : "/images/پیتزا پپرونی متوسط.jpg"
    },{
        id : 4,
        title: "پیتزا دونر استیک پنجره ای ",
        details: "خمیر پیتزا 21*21 پنجره ای ، دونر استیک گوشت ، قارچ ، پنیر موزارلا ، سس آلفردو و زیتون سیاه",
        price : 327000,
        imageUrl : "/images/پیتزا دونر استیک متوسط.jpg"
    },{
        id : 5,
        title: "پیتزا گوشت و قارچ پنجره ای ",
        details: "خمیر پیتزا 21*21 پنجره ای ، گوشت چرخ کرده ، قارچ ، فلفل دلمه ای و پنیر موزارلا",
        price : 348000,
        imageUrl : "/images/پیتزا گوشت و قارچ متوسط.jpg"
    },
]

export function getProductData(id) {
    let productData = productList.find((item) => item.id === id)
    return productData
}