

export const postsList = [
    {
        id : 1,
        title: "پیتزا رست بیف پنجره ای ",
        details: "خمیر پیتزا 21*21 پنجره ای ، رست بیف ، سس آلفردو ، قارچ ، زیتون سیاه و پنیر موزارلا",
        imageUrl: "/images/پیتزا رست بیف متوسط.jpg",
    },{
        id : 2,
        title: "پیتزا مخصوص پنجره ای ",
        details: "خمیر پیتزا 21*21 پنجره ای ، ژامبون گوشت و مرغ ، هات داگ ، گوشت چرخکرده ، قارچ ، زیتون سیاه ، فلفل دلمه ای و پنیر موزارلا",
        imageUrl : "/images/پیتزا مخصوص متوسط.jpg",
    },{
        id : 3,
        title: "پیتزا پپرونی پنجره ای ",
        details: "خمیر پیتزا 21*21 پنجره ای ، پپرونی ، سس تند ، پنیر موزارلا و فلفل هالوپینو",
        imageUrl : "/images/پیتزا پپرونی متوسط.jpg",
    },{
        id : 4,
        title: "پیتزا دونر استیک پنجره ای ",
        details: "خمیر پیتزا 21*21 پنجره ای ، دونر استیک گوشت ، قارچ ، پنیر موزارلا ، سس آلفردو و زیتون سیاه",
        imageUrl : "/images/پیتزا دونر استیک متوسط.jpg",
    },{
        id : 5,
        title: "پیتزا گوشت و قارچ پنجره ای ",
        details: "خمیر پیتزا 21*21 پنجره ای ، گوشت چرخ کرده ، قارچ ، فلفل دلمه ای و پنیر موزارلا",
        imageUrl : "/images/پیتزا گوشت و قارچ متوسط.jpg",
    },{
        id : 6,
        title: "همبرگر",
        details: "یک عدد برگر 160 گرمی ، نان گرد رومال دار کنجدی ، گوجه فرنگی ، خیار شور و کاهو",
        imageUrl : "/images/قارچ برگر.jpg",
    },{
        id : 7,
        title: "چیزبرگر",
        details: "یک عدد برگر 160 گرمی ، یک ورق پنیر گودا ، قارچ ، نان گرد رومال دار کنجدی ، گوجه فرنگی ، خیار شور و کاهو",
        imageUrl : "/images/چیز برگر .jpg",
    },{
        id : 8,
        title: "ماشروم برگر",
        details: "یک عدد برگر 160 گرمی ، قارچ ، گوجه فرنگی ، نان گرد رومال دار کنجدی ، خیار شور و کاهو",
        imageUrl : "/images/قارچ برگر.jpg",
    }
]

export function getPostData(id) {
    let postData = postsList.find((item) => item.id === id)
    return postData
}